/* -------------------------------------------------------------------------- */
/*                     일반 함수로 작성한 콜백 함수의 this                      */
/* -------------------------------------------------------------------------- */
// function Counter() {
//   this.count = 0;
//   setInterval(function () {
//     this.count++;
//     console.log(this.count);
//   }, 2000);
// }

// const counter = new Counter();
// NaN 값이 2초마다 출력됨

/* -------------------------------------------------------------------------- */
/*                     화살표 함수로 작성한 콜백 함수의 this                    */
/* -------------------------------------------------------------------------- */
// function Counter() {
//   this.count = 0;
//   setInterval(() => {
//     this.count++;
//     console.log(this.count);
//   }, 2000);
// }

// const counter = new Counter();
// count 값이 1씩 증가되어 출력됨

/* -------------------------------------------------------------------------- */
/*                       화살표 함수로 정의한 메서드의 this                     */
/* -------------------------------------------------------------------------- */
const cafe = {
  brand: "메가커피",
  menu: "아메리카노",
  print: () => {
    console.log(this);
  },
};

cafe.print();
