// 조건문
/* -------------------------------------------------------------------------- */
/*                                   if 문                                    */
/* -------------------------------------------------------------------------- */
let num = 5;

// () 안의 조건식은
// true 또는 false를 반환하는 연산식이어야 한다.

if (num < 10) {
  // true일 경우
  console.log("num은 10보다 작습니다.");
} else {
  // false일 경우
  console.log("num은 10보다 크거나 같습니다.");

  // 중첩 조건문 (가독성 저하)
  if (num > 10) {
    console.log("num은 10보다 큽니다.");
  } else {
    console.log("num은 10입니다.");
  }
}

/* -------------------------------------------------------------------------- */
/*                                 else if 문                                 */
/* -------------------------------------------------------------------------- */
let number = 5;

// () 안의 조건식은
// true 또는 false를 반환하는 연산식이어야 한다.

if (num < 10) {
  // true일 경우
  console.log("num은 10보다 작습니다.");
} else if (num > 10) {
  console.log("num은 10보다 큽니다.");
} else {
  // false일 경우
  console.log("num은 10입니다.");
}

/* -------------------------------------------------------------------------- */
/*                               switch case 문                               */
/* -------------------------------------------------------------------------- */
let fruit = "apple";

switch (fruit) {
  case "banana":
    console.log("바나나");
    break;
  case "orange":
    console.log("오렌지");
    break;
  case "apple":
    console.log("사과");
    break;
  case "grape":
    console.log("포도");
    break;
  default:
    console.log("다른 과일");
}
